P1/src/chen.reid.P1.tex
% Created 2021-09-20 Mon 22:25
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Reid Chen}
\date{\today}
\title{P1}
\hypersetup{
 pdfauthor={Reid Chen},
 pdftitle={P1},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode 9.4.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

I first created the \texttt{Sym} class and then created the \texttt{SymTable} class. While
creating \texttt{SymTable}, I also created the two Exception classes. I have decided to
use a \texttt{LinkedList} since we only care about the front of the list while adding
and removing scopes. \texttt{LinkedList} incurs less time complexity while doing these
operations than \texttt{ArrayList}.
\end{document}
